# NeverInOptionWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..NeverInOptionWarn Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Some types of elements can't belong to an Option. Elements of these types were not added to this Option Set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NeverInOptionWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NeverInOptionWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NeverInOptionWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace